---
kind: other
id: Properties.T:Autodesk.Revit.DB.SaveAsOptions
source: html/88eb49e4-7812-6096-4099-c79fb67599da.htm
---
# SaveAsOptions Properties

Default is false: let the OS eliminate as much or as little dead data as it wants to.
 True: force the OS to eliminate all dead data from the file on disk.